# vstSetCursorByView

## Description
Set appropreate cursor according to the view.

```pascal
PROCEDURE vstSetCursorByView;
```

```python

def vs.vstSetCursorByView():
    return None
```

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events